#+SETUPFILE: ~/.emacs.d/org-templates/base.org
#+TITLE:       Séance 12 : Algo & Prog avec R
#+DESCRIPTION: Introduction à la programmation R.
#+KEYWORDS:    computer science, teaching, programming, GNU R.
#+HTML_HEAD_EXTRA:    <link rel="stylesheet" type="text/css" href="http://www.i3s.unice.fr/~malapert/css/logo_uns.min.css"/>
#+HTML_LINK_HOME: ../introR.html
#+OPTIONS: num:t toc:2 H:2
#+LANGUAGE: fr
#+PROPERTY: header-args :results output :exports none
** Simulation de marches aléatoires
   Écrivez une fonction ~Walk1D(nsteps, nwalks, prob)~ renvoyant une matrice entière de taille ~(nsteps+1)~ x ~nwalks~.
   Chaque colonne donne les positions du marcheur pendant une marche aléatoire en une dimension de ~nsteps~ pas partant de 0.
   La fonction doit déclencher une erreur si ses arguments sont invalides (~stopifnot~).
      
   #+BEGIN_SRC R :session rwalk
     Walk1D <- function (nsteps, nwalks=1, prob=0.5) { 
       ## Generate random 1D walks  
       ## nwalks : number of random walks
       ## nsteps : number of steps
       ## prob : probability of success (+1)
       stopifnot(nsteps >= 1, length(nsteps) == 1, prob >= 0, prob < 1, nwalks >= 1, length(nwalks) == 1)
       ## Execute random walk(s)
       walk <- function(nsteps, prob) append(0, cumsum(ifelse(runif(nsteps) <= prob, 1,-1)))
       if(nwalks == 1) {
          return(walk(nsteps,prob))
       } else {
         return(replicate(nwalks, walk(nsteps,prob)))
       } 
     }
   #+END_SRC

   #+RESULTS:


#+BEGIN_SRC R :export both  :session rwalk
  nsteps <- 4
  set.seed(0)
  walks <- Walk1D(nsteps, nwalks=3)
  print(walks)
  set.seed(0)
  all(walks[,1] == Walk1D(nsteps))
#+END_SRC 

#+RESULTS:
:      [,1] [,2] [,3]
: [1,]    0    0    0
: [2,]   -1   -1   -1
: [3,]    0    0   -2
: [4,]    1   -1   -1
: [5,]    0   -2    0
: [1] TRUE

** Simulation 

  1. Écrire une fonction ~SimUrne(n)~ simulant les tirages jusqu'à vider l'urne $U_n$. La fonction renvoie les urnes successives $U_j$ lors des $X_n$ tirages.
  2. Écrire une fonction ~SimXn(n, m)~ simulant le nombre de tirages nécessaires pour vider l'urne $U_n$

#+BEGIN_SRC R :session urne
  SimUrne <- function(n) {
    r <- c(n)
    while( n > 0) {
      n <- sample.int(n,1) - 1
      r <- append(r, n)
    }
    return(r)
  }

  SimXn <- function(n, m) replicate(m, length(SimUrne(n))-1)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :session urne
  replicate(3, SimUrne(50))
  SimXn(100, 15)
#+END_SRC

#+RESULTS:
: [[1]]
: [1] 50 12  3  0
: 
: [[2]]
: [1] 50 32 24 15  8  5  2  1  0
: 
: [[3]]
: [1] 50 19 18  7  6  3  0
:  [1] 3 5 4 3 8 6 8 3 5 5 4 9 6 6 7


** Comparaison avec la probabilité théorique
   
   On peut établir la probabilité théorique $P(X_n = k)$ que l'urne $U_n$ soit vidée en $k$ tirages :

\begin{equation}
P(X_n = k) = 
 \begin{cases} 
   1 & \text{if } n = k = 0 \\
   0 & \text{if } k = 0 \text{ or } k > n \\
   \frac{1}{n} \sum_{i=k}^n P( X_{i-1} = k-1) & \text{Otherwise}
  \end{cases}
\end{equation}

   1. Écrire une fonction ~ProbXn(n, k)~ renvoyant la probabilité théorique $P(X_n = k)$.
   2. Écrire une fonction ~DistXn(n)~ renvoyant la distribution de $X_n$.
   3. Transformer ~ProbXn(n, k)~ en une mémo-fonction.


#+BEGIN_SRC R :results none :session urne
  MakeProbXn <- function() {
    cache <- list()
    ProbXn <- function(n,k) {
      if( k == 0) {
        ## No more draw
        return(as.numeric(n == 0))
      } else if(n < k) {
        ## less balls than draws.
        return(0)
      } else {
        if(length(cache) <= n) {
          ## Cache list not initialized at n 
           cache <<- append(cache, lapply(seq(length(cache):n), rep, x = NA))
         }
        if(is.na(cache[[n]][k])) {
          ## Cache vector not initialized at k
          cache[[n]][k] <<- sum(sapply( (k:n)-1, ProbXn, k=k-1))/n
        }
         return(cache[[n]][k])
      }
    }
  }
    
  ProbXn <- MakeProbXn()
  DistXn <- function(n) sapply(1:n, ProbXn, n = n)

#+END_SRC

   
#+BEGIN_SRC R :exports both :results value :session urne
  n <- 10
  m <- 1000
  du <- round(DistXn(n), digits = 3)
  edu <- tabulate(SimXn(n, m), n)
  edu <- round(edu/sum(edu), digits = 3)
  cbind(
    c("k", "P(X_n=k)", paste("m =", m)),
    rbind(seq_along(du), du, edu)
    )
#+END_SRC
   
#+RESULTS:
| k        |    1 |     2 |     3 |     4 |     5 |     6 |     7 | 8 | 9 | 10 |
| P(X_n=k) |  0.1 | 0.283 | 0.323 | 0.199 | 0.074 | 0.017 | 0.003 | 0 | 0 |  0 |
| m = 1000 | 0.09 | 0.274 | 0.345 | 0.193 | 0.082 |  0.01 | 0.006 | 0 | 0 |  0 |

